
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Сообщить("ПередЗаписьюНаСервере");
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Сообщить("ОбработкаПроверкиЗаполненияНаСервере");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
	Сообщить("ПередЗаписью");
КонецПроцедуры
&НаСервере
Процедура ПроцедураНаСервере()
	 
	 а = 1;
	ДокОбъект = РеквизитФормыВЗначение("Объект")
КонецПроцедуры


&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
	ТекСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекСтрока.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, ТекСтрока.Материал);
	ПроцедураНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.РассчитатьСумму(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	
	
	РаботаСДокументамиКлиент.РассчитатьСумму(Элементы.Материалы.ТекущиеДанные);
	
КонецПроцедуры

