
&НаСервере
Функция Команда1НаСервере()
	//TODO: Вставить содержимое обработчика
	Сообщить(Справочники.Склады.Основной.УникальныйИдентификатор());
	Возврат Константы.НазваниеФирмы.Получить();
КонецФункции

&НаКлиенте
Процедура Команда1(Команда)
	Сообщить(Команда1НаСервере());
	
КонецПроцедуры

&НаКлиенте
Процедура Задание2(Команда)
	//TODO: Вставить содержимое обработчика
	массивДней = Новый Массив();
	ПосленийДень = День(КонецМесяца(ДатаРождения));
	Для Сч = 1 По ПосленийДень Цикл
		массивДней.Добавить(Сч);
	КонецЦикла;
	For each ElementMassiva in массивДней do
		Сообщить(ElementMassiva);	
	endDo
		
КонецПроцедуры

&НаКлиенте
Процедура Задание1(Команда)
	//TODO: Вставить содержимое обработчика
	Регионы = Новый Соответствие();
	Регионы.Вставить(30,"Астраханская область" );
	НомерРегиона = Прав("ек344уRU63", 2);
	//Сред("ек344уRU63", СтрНайти("ек344уRU63", "RU")+2, СтрДлина("ек344уRU63")-СтрНайти("ек344уRU63", "RU")+2)
	
КонецПроцедуры
